tutorials/15MSR_cavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1050;

boundaryField
{
    movingWall
    {   
        type            fixedValue;
	value		uniform 850;
    } 
    
    bottomWall
    {
        type            fixedValue;
	value		uniform 950;
    }
    
    rightWall
    {
        type            fixedValue;
	value		uniform 950;
    }
    
    leftWall
    {
        type            fixedValue;
	value		uniform 950;
    }

    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
