tutorials/15MSR_cavity/0/flux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      flux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 -1 0 0 0 0];

internalField   uniform 1e+18;

boundaryField
{
    movingWall
    {   
        type            fixedValue;
        value           uniform 0;
    } 
    
    bottomWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    rightWall
    {
         type           fixedValue;
        value           uniform 0;
    }
    
    leftWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}

// ************************************************************************* //
