tutorials/15MSR_cavity/0/prec6
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      prec6;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   uniform 1e+19;

boundaryField
{
    movingWall
    {   
        type            fixedValue;
	value		uniform 0;
    } 
    
    bottomWall
    {
        type            fixedValue;
	value		uniform 0;
    }
    
    rightWall
    {
        type            fixedValue;
	value		uniform 0;
    }
    
    leftWall
    {
        type            fixedValue;
	value		uniform 0;
    }

    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}



// ************************************************************************* //
