tutorials/15MSR_cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4900;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4950;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5000;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5050;
    }
    frontPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       5100;
    }
    backPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       7600;
    }
)

// ************************************************************************* //
