tutorials/15MSR_cavity/constant/precursorTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      precursorTransportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Laminar Schmidt number
Sc              Sc [0 0 0 0 0 0 0] 20;

// Turbulent Schmidt number
Sct             Sct [0 0 0 0 0 0 0] 0.85;

// ************************************************************************* //
