tutorials/15MSR_cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

//msfr a 900 K
// Laminar viscosity
nu              nu [0 2 -1 0 0 0 0] 2.46E-06;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 2.14e-04;


// Reference density
rhoRef          rhoRef [1 -3 0 0 0 0 0]  4125;

// Reference density
CpRef           CpRef [0 2 -2 -1 0 0 0] 1594;

// Reference temperature
Tref            Tref [0 0 0 1 0 0 0] 973;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 16;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.85;

// Recirculation time
tau		tau [0 0 1 0 0 0 0] 6;


// ************************************************************************* //<<
