tutorials/15MSR_cavity/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}


// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// number of modes you want to compute

NUout 50;
NPout 50;
NFluxout 50;
NPrecout1 50;
NPrecout2 50;
NPrecout3 50;
NPrecout4 50;
NPrecout5 50;
NPrecout6 50;
NPrecout7 50;
NPrecout8 50;
NTout 50;
NDecout1 50;
NDecout2 50;
NDecout3 50;
NCout 50;

//number of modes used for projection 

NUproj 10; 
NPproj	5;
NFluxproj 8;  
NPrecproj1 18; 
NPrecproj2 15;
NPrecproj3 15; 
NPrecproj4 25; 
NPrecproj5 25; 
NPrecproj6 13;
NPrecproj7 20;
NPrecproj8 35; 
NTproj 25; 
NDecproj1 10;
NDecproj2 10;
NDecproj3 13; 
NCproj 5; 

//time settings
startTime       0;
finalTime       150;
timeStep        0.1;
writeEvery	5;

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;




