tutorials/15MSR_cavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {     
        solver          GAMG;
        smoother        DIC;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;

        tolerance       1e-7;
        relTol          1e-3;
        maxIter         100; 
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega|R)"
    {
        solver          GAMG;
        smoother        DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       5e-7;
        relTol          1e-3;
        maxIter         100; 
    }

    "(U|k|epsilon|omega|R)Final"
    {
        $U;
        relTol          0;
    }

    flux
    {
        solver          GAMG;
        smoother        DIC;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
        tolerance       1e-15; 
        relTol          1e-3;
        maxIter         100; 
    }

    fluxFinal
    {
        $flux;
        relTol          0;
    }

    "(prec1|prec2|prec3|prec4|prec5|prec6|prec7|prec8)"
    {
        solver          GAMG;
        smoother        DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
        tolerance       1e-15; 
        relTol          1e-3;
        maxIter         100; 
    }

 "(prec1|prec2|prec3|prec4|prec5|prec6|prec7|prec8)Final"
    {
        solver          GAMG;
        smoother        DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
        tolerance       1e-15; 
        relTol          1e-3;
        maxIter         100;
    }


    T
    {
        solver          GAMG;
        smoother        DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
        tolerance       1e-15; 
        relTol          1e-3;
        maxIter         100; 
    }

    TFinal
    {
        $T;
        relTol          0;
    }

    Tlift0
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
    Tlift1
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
    Tlift2
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
    Tlift3
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
    
    "(dec1|dec2|dec3)"
    {
        solver          GAMG;
        smoother        DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
        tolerance       1e-15; 
        relTol          1e-3;
        maxIter         100;  
    }
    

    "(dec1|dec2|dec3)Final"
    {
        solver          GAMG;
        smoother        DILU;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
        tolerance       1e-15; 
        relTol          1e-3;
        maxIter         100; 
    }

    Phi
    {
        $p;
    }


}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 20;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
    turbOnFinalIterOnly no;


    residualControl
    {
        U 	1e-5;
     	p	1e-5;
        T	1e-5;
     }

}


NPIMPLE
{
    nOuterCorrectors 20;

residualControl
    {
        flux	1e-5;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
    PhiRefCell 0;
    PhiRefValue 0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 20;
    pRefCell 0;
    pRefValue 0;
}

/*
SIMPLE
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
  //      p               1e-5;
    //    U               1e-5;
	T		1e-15;
    }
}
*/
relaxationFactors
{
    fields
    {
        p               0.3;
        flux6               0.1;
        flux5               0.1;
        flux4               0.1;
        flux3               0.1;
        flux2               0.1;
        flux1               0.1;
    }
    equations
    {
        U               0.5;
        k               0.5;
        epsilon         0.5;
	T		0.5;
    }
}


// ************************************************************************* //

